-- !Ups
CREATE TABLE `schedule` (
                         `id` INT NOT NULL AUTO_INCREMENT,
                         `id_movie` INT NULL,
                         `name` VARCHAR(100) NULL,
                         `id_room` INT NULL,
                         `room` VARCHAR(100) NULL,
                         `start_at` TIME(0) NULL,
                         `end_at` TIME(0) NULL,
                         `date` DATE NULL,
                         `ticket_price` VARCHAR(100) NULL,
                         `quantity_ticket` INT NULL,
                         `remaining_ticket` INT NULL,
                         PRIMARY KEY (`id`));
INSERT INTO schedule values
    (1,1,'MẮT BIẾC',1,          'P1','07:00:00','09:00:00','2019-12-23','120000',50,50),
    (2,1,'MẮT BIẾC',2,          'P2','18:00:00','20:00:00','2019-12-24','120000',50,50),
    (3,2,'NỮ HOÀNG BĂNG GIÁ',5, 'P5','07:00:00','09:00:00','2019-12-24','120000',70,70),
    (4,2,'NỮ HOÀNG BĂNG GIÁ',4, 'P4','07:00:00','09:00:00','2019-12-28','120000',50,50),
    (5,3,'KHỦNG LONG ĂN CHAY',7,'P7','07:00:00','09:00:00','2019-12-23','120000',50,50),
    (6,3,'KHỦNG LONG ĂN CHAY',6,'P6','09:00:00','11:00:00','2019-12-28','120000',50,50),
    (7,4,'TRÒ CHƠI KỲ ẢO',8,    'P8','08:30:00','10:30:00','2019-12-23','120000',50,50),
    (8,4,'TRÒ CHƠI KỲ ẢO',4,    'P4','09:00:00','11:00:00','2019-12-29','120000',50,50),
    (9,5,'GIÁNG SINH NĂM ẤY',8, 'P8','16:00:00','18:00:00','2019-12-22','120000',50,50),
    (10,5,'GIÁNG SINH NĂM ẤY',9,'P9','08:00:00','10:00:00','2019-12-28','120000',50,50),
    (11,6,'HỒI KẾT ĐẪM MÁU',7,  'P7','09:30:00','11:30:00','2019-12-22','120000',50,50),
    (12,6,'HỒI KẾT ĐẪM MÁU',5,  'P5','08:00:00','10:00:00','2019-12-29','120000',70,70);
-- !Downs
DROP TABLE schedule;
